Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/refactoring-omegat.tmx
Source language: en_us
Languages: pt_br

source: The refactoring might break your code since created methods have a default accessibility but some selected fields are referenced from other sources.
pt_br: A refatoração pode brecar seu código desde os métodos criados que tenham uma acessibilidade padrão, mas alguns campos selecionados são referenciados de outros códigos-fonte.

source: Cannot replace {0} in {1} with void setter in {2}.
pt_br: Impossível substituir {0} em {1} com void setter em {2}.

source: The getter already exists but with wrong return type {0}.
pt_br: O getter já existe mas com tipo de retorno incorreto {0}.

source: The getter already exists in superclass.
pt_br: O getter já existe na super classe.

source: The setter already exists but with wrong return type {0}.
pt_br: O setter já existe mas com tipo de retorno incorreto {0}.

source: The setter already exists in superclass.
pt_br: O setter já existe na super classe.

source: Nothing to encapsulate.
pt_br: Nada a encapsular

source: You have to select some checkbox.
pt_br: Você tem que selecionar algum checkbox.

source: The method overrides or implements methods in super classes/interfaces.
pt_br: O método substitui ou implementa métodos em super classes/interfaces.

source: There are methods in subclasses or implementors of {0} that override or implement the method.
pt_br: Existem métodos em subclasses ou implementações de {0} que substitue ou implementa o método.

source: You cannot use the Change Method Parameters refactoring on methods with variable arguments.
pt_br: Você não pode utilizar a refatoração Alterar Parâmetros do Método em métodos com argumentos variáveis.

source: You have to provide {0} for all new parameters.
pt_br: Você tem que fornecer {0} para todos os novos parâmetros.

source: parameter name
pt_br: nome do parâmetro

source: parameter type
pt_br: tipo do parâmetro

source: default values
pt_br: valores padrões

source: Cannot change signature.
pt_br: Impossível alterar assinatura.

source: Constructor with the same signature already exists in class {0}.
pt_br: Construtor com mesma assinatura já existe na classe {0}.

source: You have to provide values for the new parameters.
pt_br: Você tem que fornecer valores para os novos parâmetros.

source: Duplicate parameter name ({0}).
pt_br: Nome de parâmetro duplicado ({0}).

source: Name "{0}" is already used as a name of local variable.
pt_br: Nome "{0}" já é usado como um nome de variável local.

source: Cannot change modifiers of method in interface.
pt_br: Impossível alterar modificadores de métodos em interface.

source: You changed the access modifier to {0}.
pt_br: Você alterou o modificador de acesso para {0}.

source: Method will not be accessible for some of references.
pt_br: Método não estará acessível para algumas referências.

source: The sources will not compile after refactoring!
pt_br: Os códigos-fonte não serão compilados depois da refatoração!

source: Cannot change parameters of this object.
pt_br: Impossível alterar parâmetros deste objeto.

source: A method or the constructor has to be selected.
pt_br: Um método ou o construtor tem que ser selecionado.

source: You have not selected anything to find.
pt_br: Você não selecionou nada para pesquisar.

source: Select Find Usages, Find Overriding Methods, or both.
pt_br: Selecionar Procurar utilizações, Procurar métodos de sobrecarga, ou ambos.

source: Cannot refactor read-only file "{0}"
pt_br: Impossível refatorar o arquivo somente leitura "{0}"

source: @interface members may not have parameters.
pt_br: membros da @interface podem não ter parâmetros.

source: Cannot change parameters of "{0}" which overrides method from library class.
pt_br: Impossível mudar parâmetros de "{0}" que sobreescreve o método da classe biblioteca.

source: Varargs can be used only in the final argument position.
pt_br: Varargs podem ser usados apenas na posição final do argumento.

source: Rename
pt_br: Renomear

source: Apply Rename on &Comments
pt_br: Renomear em &comentários

source: Change Method &Parameters...
pt_br: Alterar &parâmetros do método...

source: Change Method Parameters
pt_br: Alterar parâmetros do método

source: Rename <b>{0}</b> to <b>{1}</b>
pt_br: Renomear <b>{0}</b> para <b>{1}</b>

source: Usages of <b>{0}</b>
pt_br: Utilizações de <b>{0}</b>

source: Overriding Methods
pt_br: Sobreescrevendo métodos

source: Search From Base Class
pt_br: Procurar da classe base

source: Find All SubTypes of <b>{0}</b>
pt_br: Encontrar todos os subtipos de <b>{0}</b>

source: Find Direct SubTypes of <b>{0}</b>
pt_br: Encontrar subtipos diretos de <b>{0}</b>

source: of <b>{0}</b>
pt_br: de <b>{0}</b>

source: and
pt_br: e

source: Encapsula&te Fields...
pt_br: Enca&psular campos...

source: Encapsulate Fields
pt_br: Encapsular campos

source: Encapsulate fields in class <b>{0}</b>
pt_br: Encapsular campos na classe <b>{0}</b>

source: Move source to package "{0}"
pt_br: Move código-fonte para o pacote "{0}"

source: Move "{0}" to package "{1}"
pt_br: Mover "{0}" para o pacote "{1}"

source: Move to "{0}" package
pt_br: Mover para o pacote "{0}"

source: Add import {0}
pt_br: Adiconar importação {0}

source: Remove import {0}
pt_br: Remover importação {0}

source: Move &Class...
pt_br: Mover &classe...

source: Move Package...
pt_br: Mover pacote...

source: Move Class
pt_br: Mover classe

source: Class was moved into another package and refactoring is necessary.
pt_br: A classe foi movida para dentro de outro pacote e a refatoração é necessária.

source: Multiple classes were moved into another package and refactoring is necessary.
pt_br: Múltiplas classes foram movidas para dentro de outro pacote e a refatoração é necessária.

source: Move Classes
pt_br: Mover classes

source: Move listed classes
pt_br: Mover classes listadas

source: Move Package
pt_br: Mover pacotes

source: Move class <b>{0}</b> to <b>{1}</b> package
pt_br: Mover classe <b>{0}</b> para o pacote <b>{1}</b>

source: Move package <b>{0}</b> to <b>{1}</b> package
pt_br: Mover pacote <b>{0}</b> para o pacote <b>{1}</b>

source: Move class {0}
pt_br: Mover classe {0}

source: List of &Classes:
pt_br: Lista de &classes:

source: Move package {0}
pt_br: Mover pacotes {0}

source: &To Package:
pt_br: Para paco&te:

source: Package "{0}" is located in more than one project.
pt_br: Pacote "{0}" está localizado em mais de um projeto.

source: Please, select the desired package in the Package Chooser.
pt_br: Por favor, selecione o pacote desejado na Seleção de pacote.

source: Cannot proceed.
pt_br: Não pode continuar.

source: Package "{0}" is located only in read-only projects.
pt_br: O pacote "{0}" está localizado apenas em projetos somente leitura.

source: A package corresponding to the entered name cannot be found.
pt_br: Um pacote que corresponde ao nome informado não pode ser encontrado.

source: &lt;default&gt;
pt_br: &lt;padrão&gt;

source: Open In Navigator
pt_br: Abrir no navegador

source: &New Name:
pt_br: &Novo nome:

source: error
pt_br: erro

source: Cannot refactor this object.
pt_br: Impossível refatorar esse objeto.

source: File is empty.
pt_br: O arquivo está vazio.

source: Cannot find references.
pt_br: Não foi possível encontrar referências.

source: &lt;anonymous class&gt;
pt_br: &lt;classe anônima&gt;

source: &lt;initializer&gt;
pt_br: &lt;inicializador&gt;

source: Method
pt_br: Método

source: Field
pt_br: Campo

source: Constructor
pt_br: Construtor

source: Local Variable
pt_br: Variável local

source: Parameter
pt_br: Parâmetro

source: Folder
pt_br: Diretório

source: Package
pt_br: Pacote

source: Class
pt_br: Classe

source: <html>Method <b>{0}</b> of class <b>{1}</b></html>
pt_br: <html>Metódo <b>{0}</b> da classe <b>{1}</b></html>

source: <html>Class <b>{0}</b></html>
pt_br: <html>Classe <b>{0}</b></html>

source: <html>Constructor <b>{0}</b> of class <b>{1}</b></html>
pt_br: <html>Construtor <b>{0}</b> da classe <b>{1}</b></html>

source: <html>Field <b>{0}</b> of class <b>{1}</b></html>
pt_br: <html>Campo <b>{0}</b> da classe <b>{1}</b></html>

source: <html>Package <b>{0}</b></html>
pt_br: <html>Pacote <b>{0}</b></html>

source: <html>Variable <b>{0}</b></html>
pt_br: <html>Variável <b>{0}</b></html>

source: Name
pt_br: Nome

source: Type
pt_br: Tipo

source: Default Value
pt_br: Valor padrão

source: Original Index
pt_br: Índice original

source: Used
pt_br: Utilizado

source: Access &Modifier:
pt_br: &Modificador de acesso:

source: &Parameters:
pt_br: &Parâmetros:

source: Method Signature Preview
pt_br: Visualização de assinatura de método

source: &Add
pt_br: &Adicionar

source: R&emove
pt_br: R&emover

source: Move &Up
pt_br: Mover para &cima

source: Move &Down
pt_br: Mover para &baixo

source: Parameter "{0}" is used within method body.
pt_br: O parâmetro "{0}" é utilizado como corpo de método.

source: Do you really want to delete "{0}"?
pt_br: Deseja mesmo excluir "{0}"?

source: Change parameters of <b>{0}</b> {1} to <b>{2}</b>
pt_br: Alterar parâmetros do {1} <b>{0}</b> para <b>{2}</b>

source: method
pt_br: método

source: constructor
pt_br: construtor

source: Create Getter
pt_br: Criar getter

source: Create Setter
pt_br: Criar setter

source: &List of Fields to Encapsulate:
pt_br: &Lista de campos à encapsular:

source: Fields' &Visibility:
pt_br: &Visibilidade dos campos:

source: &Accessors' Visibility:
pt_br: Visibilid&ade dos métodos:

source: &Use Accessors Even When Field Is Accessible
pt_br: &Utilizar métodos de acesso quando o campo é acessível

source: Pr&oject:
pt_br: Pr&ojeto:

source: &Location:
pt_br: &Localização:

source: Find &Usages
pt_br: Encontrar &utilizações

source: Find &Overriding Methods
pt_br: Encontrar por métodos &sobrescritos

source: &Search from Base Class [{0}]
pt_br: &Procurar da classe base [{0}]

source: Find &All Subtypes
pt_br: Encontrar &todos os subtipos

source: Find &Direct Subtypes Only
pt_br: Encontrar apenas subtipos &diretos

source: Add parameter
pt_br: Adicionar parâmetro

source: Type new name
pt_br: Digite um novo nome

source: Destination Supertype
pt_br: Destino do supertipo

source: Members To Pull Up
pt_br: Membros para retirar

source: Select members to Pull Up
pt_br: Selecione os membros para retirar

source: Members To Push Down
pt_br: Membros para colocar

source: Select members to Push Down
pt_br: Selecione membros para colocar

source: Declare Field For Current Outer Class
pt_br: Declarar campo para a classe externa atual

source: Inner Class Name
pt_br: Nome da classe interna

source: Declare Static
pt_br: Declarar estático

source: Interface Name
pt_br: Nome da interface

source: Members To Extract
pt_br: Membros para extrair

source: Members To Extract Description
pt_br: Descrição dos membros para extrair

source: Superclass Name
pt_br: Nome da superclasse

source: Superclass name
pt_br: Nome da superclasse

source: Supertype To Use
pt_br: Supertipo a utilizar

source: Select Supertype to Use
pt_br: Selecionar supertipo a utilizar

source: This Class:
pt_br: Esta classe:

source: <default package>
pt_br: <pacote padrão>

source: Search in &Comments
pt_br: Procurar em &comentários

source: Find Usages Results
pt_br: Procurar resultados de utilizações

source: Refactoring Preview
pt_br: Visualização da refatoração

source: Rename &Without Refactoring
pt_br: Renomear &sem refatorar

source: Move &Without Refactoring
pt_br: Mover &sem refatorar

source: &lt;not available&gt;
pt_br: &lt;não disponível&gt;

source: Delete element(s) and keep references to them, if any.
pt_br: Excluir elemento(s) e manter referências a eles, se houver.

source: Delete classes and and keep references to them, if any.
pt_br: Excluir classes e manter referências a eles, se houver.

source: Delete method <b>{0}</b> and keep references to that method, if any.
pt_br: Excluir método <b>{0}</b> e manter referências para este método, se houver.

source: Delete methods and keep keep references to them, if any.
pt_br: Excluir métodos e manter referências para eles, se houver.

source: There are references to <b>{0}</b>.
pt_br: Existem referências para <b>{0}</b>.

source: Delete
pt_br: Excluir

source: <html>Search for usages and delete {0} classes</html>
pt_br: <html>Procurar por utilizações e excluir classes {0}</html>

source: <html>Search for usages and delete {0} elements</html>
pt_br: <html>Procurar por utilizações e excluir elementos {0}</html>

source: <html>Delete {0} classes</html>
pt_br: <html>Excluir classes {0}</html>

source: <html>Delete {0}</html>
pt_br: <html>Excluir {0}</html>

source: <html>Search for usages and delete <b>{0}</b>.</html>
pt_br: <html>Procurar por utilizações e excluir <b>{0}</b>.</html>

source: Sa&fe delete (with usage search)
pt_br: Exclusão se&gura (com procura de utilização)

source: <html>Safely delete <b>{0}</b>.</html>
pt_br: <html>Exclusão segura de <b>{0}</b>.</html>

source: &Search In Comments
pt_br: Procurar em comentário&s

source: <html>Warning: Attempting to delete <b>{0}</b> from a reference.</html>
pt_br: <html>Aviso: Tentando excluir <b>{0}</b> de uma referência.</html>

source: <html>Safely delete constructor <b>{0}</b> of class <b>{1}</b>.</html>
pt_br: <html>Exclusão segura do construtor <b>{0}</b> da classe <b>{1}</b>.</html>

source: <html>Safely delete variable <b>{0}</b>.</html>
pt_br: <html>Exclusão segura da variável <b>{0}</b>.</html>

source: <html>Safely delete method <b>{0}</b> of class <b>{1}</b>.</html>
pt_br: <html>Exclusão segura do método <b>{0}</b> da classe <b>{1}</b>.</html>

source: <html>Safely delete field <b>{0}</b> of class <b>{1}</b>.</html>
pt_br: <html>Exclusão segura do campo <b>{0}</b> da classe <b>{1}</b>.</html>

source: Extract Interface
pt_br: Extrair interface

source: Extract Interface <b>{0}</b>
pt_br: Extrair interface <b>{0}</b>

source: Extract &Interface...
pt_br: Extrair &interface...

source: Extract Interface - {0}
pt_br: Extrair interface - {0}

source: Interface &Name:
pt_br: Nome da &interace:

source: &Members to Extract:
pt_br: &Membros para extrair

source: Member
pt_br: Membro

source: Extract Superclass
pt_br: Extrair superclasse

source: Extract Superclass <b>{0}</b>
pt_br: Extrair superclasse <b>{0}</b>

source: &Extract Superclass...
pt_br: &Extrair superclasse...

source: Extract Superclass - {0}
pt_br: Extrair superclass - {0}

source: Superclass &Name:
pt_br: &Nome da superclasse:

source: Make Abstract
pt_br: Tornar abstrato

source: Pull Up
pt_br: Retirar

source: Pull Up Members Of <b>{0}</b>
pt_br: Retirar membros de <b>{0}</b>

source: Pull &Up...
pt_br: &Retirar...

source: Destination &Supertype:
pt_br: Destino do &supertipo:

source: Pull Up Members of "{0}"
pt_br: Retirar membros de "{0}"

source: &Members to Pull Up:
pt_br: &Membros para retirar:

source: Push Down
pt_br: Colocar

source: Push Down Members Of <b>{0}</b>
pt_br: Colocar membros de <b>{0}</b>

source: Push &Down...
pt_br: &Colocar...

source: Push Down Members of "{0}"
pt_br: Colocar membros de "{0}"

source: &Members to Push Down:
pt_br: &Membros para colocar:

source: Keep Abstract
pt_br: Manter abstrato

source: Use Supertype Where Possible
pt_br: Utilizar supertipo onde possível

source: Use Supertype Where Possible - {0}
pt_br: Utilizar supertipo onde possível - {0}

source: Use Supertype &Where Possible...
pt_br: Utilizar supertipo o&nde possível...

source: Supertype to Use:
pt_br: Supertipo a utilizar

source: &Apply Rename on Comments
pt_br: Renome&ar comentários

source: Move Inner to Outer Level
pt_br: Mover classe interna para um nível externo

source: Move <b>{0}</b> to Outer Level
pt_br: Mover <b>{0}</b> para nível externo

source: Move Inner to Outer &Level...
pt_br: Mover níve&l interno para externo

source: &Class Name:
pt_br: Nome da &classe:

source: Move "{0}" to Outer Level
pt_br: Mover "{0}" para nível externo

source: &Declare Field for the Current Outer Class
pt_br: &Declarar campos para a classe externa atual

source: &Field Name:
pt_br: Nome do &campo:

source: Copy Class
pt_br: Copiar classe

source: Copy Class <b>{0}</b>
pt_br: Copiar classe <b>{0}</b>

source: &Copy Without Refactoring
pt_br: &Copiar sem refatoração

source: Rename file, class, and constructors to {0}
pt_br: Renomear arquivo, classe e construtores para {0}

source: Rename class and constructors to {0}
pt_br: Renomear classe e construtores para {0}

source: Rename method to {0}
pt_br: Renomear método para {0}

source: Rename field to {0}
pt_br: Renomear campo para {0}

source: Rename parameter to {0}
pt_br: Renomear parâmetro para {0}

source: Rename local variable to {0}
pt_br: Renomear variável local para {0}

source: Rename attribute to {0}
pt_br: Renomear atributo para {0}

source: Rename type parameter to {0}
pt_br: Renomear tipo de parâmetro para {0}

source: Rename enumeration to {0}
pt_br: Renomear enumeração para {0}

source: Rename annotation type to {0}
pt_br: Renomear tipo de anotação para {0}

source: Rename folder "{0}" to "{1}"
pt_br: Renomear pasta "{0}" para "{1}"

source: Change {0} parameters of {1}
pt_br: Alterar parâmetros do {0} de {1}

source: Scope:
pt_br: Escopo:

source: Open Projects
pt_br: Abrir projetos

source: NewClass
pt_br: NovaClasse

source: Cannot perform the {0} refactoring
pt_br: Impossível realizar a refatoração {0}
